{
 "ID": 203,
 "Name": "Observable Differences in Behavior to Error Inputs",
 "Description": "Differences in device behavior to an error input may be used by an attacker to gather security-relevant information about the device. The information may be as simple as whether a particular operation was successful.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "Separation of Privilege",
    "Description": [
     "Compartmentalize the system to have \"safe\" areas where trust boundaries can be unambiguously drawn. Do not allow sensitive data to go outside of the trust boundary and always be careful when interfacing with a compartment outside of the safe area.",
     "Ensure that appropriate compartmentalization is built into the system design and that the compartmentalization allows for and reinforces privilege separation functionality. Architects and designers should rely on the principle of least privilege to decide the appropriate time to use privileges and the time to drop privileges."
    ]
   },
   {
    "Phase": [
     "Implementation"
    ],
    "Strategy": "",
    "Description": [
     "Ensure that error messages only contain minimal details that are useful to the intended audience and no one else. The messages need to strike a balance between being too cryptic and confusing users. The messages should not reveal the methods that were used to determine the error. Such detailed information may be used to refine an attack and increase the chances of a successful attack.",
     "If errors must be captured in detail, the messages should be saved into log messages. Highly sensitive information such as passwords should never be saved to log files. Avoid inconsistent messaging that might accidentally tip off an attacker about the internal device state, such as whether a username is valid or not."
    ]
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 189
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Confidentiality",
     "Access Control"
    ],
    "Impact": [
     "Read Application Data",
     "Bypass Protection Mechanism"
    ]
   },
   {
    "Scope": [
     "Confidentiality"
    ],
    "Impact": [
     "Read Application Data"
    ]
   }
  ]
 },
 "ExtendedDescription": null
}