{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20131792",
  "Version": "632",
  "Metadata": {
    "Title": "RHSA-2013:1792: Red Hat Enterprise Linux 6.2 Extended Update Support 1-Month Notice (Low)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 6.2 EUS - Server and Compute Node Only"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2013:1792",
        "RefURL": "https://access.redhat.com/errata/RHSA-2013:1792"
      }
    ],
    "Description": "In accordance with the Red Hat Enterprise Linux Errata Support Policy,\nExtended Update Support for Red Hat Enterprise Linux 6.2 will be retired as\nof January 7, 2014, and support will no longer be provided. Accordingly,\nRed Hat will no longer provide updated packages, including critical impact\nsecurity patches or urgent priority bug fixes, for Red Hat Enterprise Linux\n6.2 EUS after that date. In addition, technical support through Red Hat's\nGlobal Support Services will no longer be provided after January 7, 2014.\n\nNote: This notification applies only to those customers subscribed to the\nExtended Update Support (EUS) channel for Red Hat Enterprise Linux 6.2.\n\nWe encourage customers to plan their migration from Red Hat Enterprise\nLinux 6.2 to a more recent version of Red Hat Enterprise Linux 6. As a\nbenefit of the Red Hat subscription model, customers can use their active\nsubscriptions to entitle any system on a currently supported Red Hat\nEnterprise Linux 6 release (6.3 or 6.4, for which EUS is available).\n\nDetails of the Red Hat Enterprise Linux life cycle can be found here:\nhttps://www.redhat.com/security/updates/errata/",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Low",
      "Rights": "Copyright 2013 Red Hat, Inc.",
      "Issued": {
        "Date": "2013-12-05"
      },
      "Updated": {
        "Date": "2013-12-05"
      },
      "AffectedCpeList": [
        "cpe:/o:redhat:rhel_eus:6.2",
        "cpe:/o:redhat:rhel_eus:6.2::server"
      ]
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20111656004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 6 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20111656003"
          },
          {
            "Comment": "redhat-release-server is earlier than 0:6Server-6.2.0.5.el6_2",
            "TestRef": "oval:com.redhat.rhsa:tst:20131792001"
          },
          {
            "Comment": "redhat-release-server is signed with Red Hat redhatrelease2 key",
            "TestRef": "oval:com.redhat.rhsa:tst:20121015002"
          }
        ]
      }
    ]
  }
}